blog/app/controllers/posts_controller.rb

  def create
    #render plain: params[:post].inspect
    @post=Post.new(post_params)
    if(@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hola"], ["body", "ir a hacer la compra"], ["created_at", "2019-07-08 19:25:46.099848"], ["updated_at", "2019-07-08 19:25:46.099848"]]

  def update
    show
    if(@post.update(post_params))
---
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "leche"], ["updated_at", "2019-07-08 19:26:57.571809"], ["id", 15]]

  def destroy
    show
    @post.delete
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 13]]